app/controllers/imports_controller.rb

  def index
    @imports = Import.all
---
SELECT "imports".* FROM "imports"

    def set_import
      @import = Import.find(params[:id])
---
SELECT  "imports".* FROM "imports" WHERE "imports"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]