app/models/import.rb

    def import(import_file)
        @import = Import.create()
        total_imports = 0
        total_price = 0
        File.foreach( import_file.path ).with_index do |line, index|
            next if index == 0
            fields = line.split("\t")
            venda = @import.vendas.new(comprador: fields[0], descricao: fields[1], preco_unitario: fields[2], quantidade: fields[3], endereco: fields[4], fornecedor: fields[5])
            if venda.save
---
INSERT INTO "imports" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-05-07 13:22:46.857498"], ["updated_at", "2021-05-07 13:22:46.857498"]]
INSERT INTO "vendas" ("comprador", "descricao", "preco_unitario", "quantidade", "endereco", "fornecedor", "import_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)